app/views/comments/_comment.html.erb

  <b>@</b>
  <%= time_ago_in_words(comment.created_at) %> ago
---
INSERT INTO `comments` (`updated_at`, `created_at`, `article_id`, `user_id`, `comment`) VALUES ('2011-12-14 09:56:56', '2011-12-14 09:56:56', 4, 1, '3\'rd comment\r\n')