app/controllers/articles_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `articles` (`published`, `created_at`, `name`, `description`, `rate`, `topic`, `user_id`, `updated_at`) VALUES (1, '2011-12-13 09:07:29', 'urjit third article', 'sdf asasd dfdf asa gfg fgf sw fr ht dfdw er ewdw ;, okjo w ds gf wew we egdf weqw wed sdf asasd dfdf asa gfg fgf sw fr ht dfdw er ewdw ;, okjo w ds gf wew we egdf weqw wed sdf asasd dfdf asa gfg fgf sw fr ht dfdw er ewdw ;, okjo w ds gf wew we egdf weqw wed sdf asasd dfdf asa gfg fgf sw fr ht dfdw er ewdw ;, okjo w ds gf wew we egdf weqw wed sdf asasd dfdf asa gfg fgf sw fr ht dfdw er ewdw ;, okjo w ds gf wew we egdf weqw wed ', 0, 'indian history', 1, '2011-12-13 09:07:29')
---
  def create
    @user = User.find(params[:user_id])
    @article = Article.new(params[:article])
    @article.user_id = params[:user_id]
    @article.rate = 0
    respond_to do |format|
      if @article.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
---
  def show
    @user = User.find(params[:user_id])
    @article = Article.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.find(params[:user_id])
    @article = Article.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `updated_at` = '2011-12-12 13:09:10', `topic` = 'cricket history' WHERE `articles`.`id` = 1
---
  def update
    @user = User.find(params[:user_id])
    @article = Article.find(params[:id])
    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE (`comments`.article_id = 2)
---
  def view_article
    @user = User.find(params[:user_id])
    @article = Article.find(params[:article_id])
    @comment = Comment.new
    @comments = Comment.find(:all, :conditions => ['article_id =? ', params[:article_id]])