app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `updated_at`, `comment`, `created_at`, `article_id`) VALUES (1, '2011-12-14 09:56:40', '2\'nd comment', '2011-12-14 09:56:40', 4)
---
  def create
    @comment = Comment.new(params[:comment])
    @comment.user_id = params[:user_id]
    @comment.article_id = params[:article_id]
    if @comment.save