app/controllers/home_controller.rb

  def index
    @article = Article.all
---
SELECT `articles`.* FROM `articles`